Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/btzbsys.h
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel_top Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel_top Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Pos)) /* Assigment of value for subsys_dbg_bus_sel_top in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Pos _UINT32_(2)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Pos)) /* Assigment of value for subsys_dbg_bus_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_src_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_src_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Pos)) /* Assigment of value for subsys_clk_src_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Pos _UINT32_(6)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_div_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_div_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Pos)) /* Assigment of value for ssubsys_clk_div_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_disable_one_sec_counter_Pos _UINT32_(10)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) disable_one_sec_counter Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_disable_one_sec_counter_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_disable_one_sec_counter_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) disable_one_sec_counter Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_disable_one_sec_counter(value) (BTZBSYS_SUBSYS_CNTRL_REG1_disable_one_sec_counter_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_disable_one_sec_counter_Pos)) /* Assigment of value for disable_one_sec_counter in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_en_Pos _UINT32_(11)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_en_Pos)) /* Assigment of value for subsys_dbg_bus_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Pos _UINT32_(12)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_xtal_ready_delay Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Msk (_UINT32_(0xF) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_xtal_ready_delay Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Pos)) /* Assigment of value for subsys_xtal_ready_delay in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Pos)) /* Assigment of value for tr_sw_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Pos _UINT32_(17)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_n_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_n_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Pos)) /* Assigment of value for tr_sw_n_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Pos _UINT32_(18)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) pa_on_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) pa_on_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Pos)) /* Assigment of value for pa_on_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Pos _UINT32_(19)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) lna_on_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) lna_on_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Pos)) /* Assigment of value for lna_on_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Pos _UINT32_(20)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Pos)) /* Assigment of value for zb_bt_bar_ovrd_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Pos _UINT32_(21)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_val Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_val Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val(value) (BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Pos)) /* Assigment of value for zb_bt_bar_ovrd_val in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Pos _UINT32_(22)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) invert_btadc_clk Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) invert_btadc_clk Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk(value) (BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Pos)) /* Assigment of value for invert_btadc_clk in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Pos _UINT32_(23)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) clk_lp_req Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) clk_lp_req Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req(value) (BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Pos)) /* Assigment of value for clk_lp_req in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_en_Pos _UINT32_(26)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) xtal_lock_cnt_rstn_ovrd_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) xtal_lock_cnt_rstn_ovrd_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_en_Pos)) /* Assigment of value for xtal_lock_cnt_rstn_ovrd_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_val_Pos _UINT32_(27)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) xtal_lock_cnt_rstn_ovrd_val Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_val_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_val_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) xtal_lock_cnt_rstn_ovrd_val Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_val(value) (BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_val_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_xtal_lock_cnt_rstn_ovrd_val_Pos)) /* Assigment of value for xtal_lock_cnt_rstn_ovrd_val in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_en_Pos _UINT32_(28)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) pll_lock_flops_rstn_ovrd_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) pll_lock_flops_rstn_ovrd_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_en_Pos)) /* Assigment of value for pll_lock_flops_rstn_ovrd_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_val_Pos _UINT32_(29)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) pll_lock_flops_rstn_ovrd_val Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_val_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_val_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) pll_lock_flops_rstn_ovrd_val Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_val(value) (BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_val_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_pll_lock_flops_rstn_ovrd_val_Pos)) /* Assigment of value for pll_lock_flops_rstn_ovrd_val in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_die_clk_sel_Pos _UINT32_(30)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) die_clk_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_die_clk_sel_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_die_clk_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) die_clk_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_die_clk_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_die_clk_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_die_clk_sel_Pos)) /* Assigment of value for die_clk_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_disable_adc_clk_gating_Pos _UINT32_(31)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) disable_adc_clk_gating Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_disable_adc_clk_gating_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_disable_adc_clk_gating_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) disable_adc_clk_gating Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_disable_adc_clk_gating(value) (BTZBSYS_SUBSYS_CNTRL_REG1_disable_adc_clk_gating_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_disable_adc_clk_gating_Pos)) /* Assigment of value for disable_adc_clk_gating in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_Msk         _UINT32_(0xFCFFFC7F)                                 /* (BTZBSYS_SUBSYS_CNTRL_REG1) Register Mask  */


