Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/btzbsys.h
/* -------- BTZBSYS_SUBSYS_CNTRL_REG2 : (BTZBSYS Offset: 0x08) (R/W 32) SUBSYS_CNTRL_REG2 -------- */
#define BTZBSYS_SUBSYS_CNTRL_REG2_RESETVALUE  _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_CNTRL_REG2) SUBSYS_CNTRL_REG2  Reset Value */

#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_0_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_0 Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_0_Msk (_UINT32_(0x7) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_0_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_0 Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_0(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_0_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_0_Pos)) /* Assigment of value for crossbar_data_line_sel_0 in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_1_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_1 Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_1_Msk (_UINT32_(0x7) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_1_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_1 Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_1(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_1_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_1_Pos)) /* Assigment of value for crossbar_data_line_sel_1 in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_2_Pos _UINT32_(8)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_2 Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_2_Msk (_UINT32_(0x7) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_2_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_2 Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_2(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_2_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_2_Pos)) /* Assigment of value for crossbar_data_line_sel_2 in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_3_Pos _UINT32_(12)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_3 Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_3_Msk (_UINT32_(0x7) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_3_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_3 Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_3(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_3_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_3_Pos)) /* Assigment of value for crossbar_data_line_sel_3 in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_4_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_4 Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_4_Msk (_UINT32_(0x7) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_4_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_4 Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_4(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_4_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_4_Pos)) /* Assigment of value for crossbar_data_line_sel_4 in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_5_Pos _UINT32_(20)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_5 Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_5_Msk (_UINT32_(0x7) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_5_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_line_sel_5 Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_5(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_5_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_line_sel_5_Pos)) /* Assigment of value for crossbar_data_line_sel_5 in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_invert_Pos _UINT32_(26)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_invert Position */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_invert_Msk (_UINT32_(0x3F) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_invert_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG2) crossbar_data_invert Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_invert(value) (BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_invert_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG2_crossbar_data_invert_Pos)) /* Assigment of value for crossbar_data_invert in the BTZBSYS_SUBSYS_CNTRL_REG2 register */
#define BTZBSYS_SUBSYS_CNTRL_REG2_Msk         _UINT32_(0xFC777777)                                 /* (BTZBSYS_SUBSYS_CNTRL_REG2) Register Mask  */


/* -------- BTZBSYS_SUBSYS_CNTRL_REG3 : (BTZBSYS Offset: 0x0C) (R/W 32) SUBSYS_CNTRL_REG3 -------- */
#define BTZBSYS_SUBSYS_CNTRL_REG3_RESETVALUE  _UINT32_(0x240)                                      /*  (BTZBSYS_SUBSYS_CNTRL_REG3) SUBSYS_CNTRL_REG3  Reset Value */

#define BTZBSYS_SUBSYS_CNTRL_REG3_le_2m_fpga_v1c0_mode_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG3) le_2m_fpga_v1c0_mode Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_le_2m_fpga_v1c0_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_le_2m_fpga_v1c0_mode_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) le_2m_fpga_v1c0_mode Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_le_2m_fpga_v1c0_mode(value) (BTZBSYS_SUBSYS_CNTRL_REG3_le_2m_fpga_v1c0_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_le_2m_fpga_v1c0_mode_Pos)) /* Assigment of value for le_2m_fpga_v1c0_mode in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_subsys_pll_ready_delay_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG3) subsys_pll_ready_delay Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_subsys_pll_ready_delay_Msk (_UINT32_(0x3F) << BTZBSYS_SUBSYS_CNTRL_REG3_subsys_pll_ready_delay_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) subsys_pll_ready_delay Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_subsys_pll_ready_delay(value) (BTZBSYS_SUBSYS_CNTRL_REG3_subsys_pll_ready_delay_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_subsys_pll_ready_delay_Pos)) /* Assigment of value for subsys_pll_ready_delay in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_dfe_Pos _UINT32_(7)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG3) disable_pclk_dfe Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_dfe_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_dfe_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) disable_pclk_dfe Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_dfe(value) (BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_dfe_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_dfe_Pos)) /* Assigment of value for disable_pclk_dfe in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_zb_mdm_Pos _UINT32_(8)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG3) disable_pclk_zb_mdm Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_zb_mdm_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_zb_mdm_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) disable_pclk_zb_mdm Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_zb_mdm(value) (BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_zb_mdm_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_disable_pclk_zb_mdm_Pos)) /* Assigment of value for disable_pclk_zb_mdm in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_en_Pos _UINT32_(9)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_en(value) (BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_en_Pos)) /* Assigment of value for pll_lock_fifo_en in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_auto_relock_en_Pos _UINT32_(10)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_auto_relock_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_auto_relock_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_auto_relock_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_auto_relock_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_auto_relock_en(value) (BTZBSYS_SUBSYS_CNTRL_REG3_pll_auto_relock_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_auto_relock_en_Pos)) /* Assigment of value for pll_auto_relock_en in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_soft_reset_Pos _UINT32_(11)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_empty_soft_reset Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_soft_reset_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_soft_reset_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_empty_soft_reset Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_soft_reset(value) (BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_soft_reset_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_soft_reset_Pos)) /* Assigment of value for pll_lock_fifo_empty_soft_reset in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_clk_src_sel_Pos _UINT32_(12)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_clk_src_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_clk_src_sel_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_clk_src_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_clk_src_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_clk_src_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_clk_src_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_clk_src_sel_Pos)) /* Assigment of value for pll_lock_fifo_clk_src_sel in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_rst_en_Pos _UINT32_(13)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_empty_rst_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_rst_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_rst_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG3) pll_lock_fifo_empty_rst_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_rst_en(value) (BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_rst_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG3_pll_lock_fifo_empty_rst_en_Pos)) /* Assigment of value for pll_lock_fifo_empty_rst_en in the BTZBSYS_SUBSYS_CNTRL_REG3 register */
#define BTZBSYS_SUBSYS_CNTRL_REG3_Msk         _UINT32_(0x00003FFF)                                 /* (BTZBSYS_SUBSYS_CNTRL_REG3) Register Mask  */


